In [10]:
import pandas as pd

data = {'Company': ['GOOG', 'GOOG', 'MSTF', 'MSTF', 'FB', 'FB'],
        'Sales':[200,120,340, 124, 243, 350]}

In [11]:
df = pd.DataFrame(data)

In [13]:
df

  Company  Sales
0    GOOG    200
1    GOOG    120
2    MSTF    340
3    MSTF    124
4      FB    243
5      FB    350

In [17]:
by_comp = df.groupby('Company')

In [22]:
by_comp_mean = by_comp.mean()

In [23]:
by_comp_mean['Company']

KeyError: 'Company'

In [26]:
by_comp_mean.reset_index(inplace=True)

In [27]:
by_comp_mean['Company']

0      FB
1    GOOG
2    MSTF
Name: Company, dtype: object

In [31]:
by_comp.std()

         Sales
Company
FB         243
GOOG       120
MSTF       124

In [32]:
by_comp.median()

         Sales
Company
FB       296.5
GOOG     160.0
MSTF     232.0

In [33]:
by_comp.max()

         Sales
Company
FB         350
GOOG       200
MSTF       340

In [34]:
by_comp.min()

         Sales
Company
FB         243
GOOG       120
MSTF       124

In [35]:
by_comp.count()

         Sales
Company
FB           2
GOOG         2
MSTF         2

In [37]:
by_comp.agg(['sum', 'std'])

        Sales
          sum         std
Company
FB        593   75.660426
GOOG      320   56.568542
MSTF      464  152.735065

In [39]:
by_comp.describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSTF      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [41]:
df.describe()

            Sales
count    6.000000
mean   229.500000
std    100.899455
min    120.000000
25%    143.000000
50%    221.500000
75%    315.750000
max    350.000000

In [43]:
by_comp.describe().T

Company              FB        GOOG        MSTF
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

In [44]:
by_comp.describe().transpose()

Company              FB        GOOG        MSTF
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000